# UpdaterData Properties

---
The UpdaterData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
UpdaterData Class
Autodesk.Revit.DB Namespace